manual_run_3/manual_31_172.31.61.152_16m-detector.log
hostname=ip-172-31-61-152, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-61-152> 16m-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-61-152> 16m-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-61-152> ...
<ip-172-31-61-152> Starting 4 processes
<ip-172-31-61-152> 16m-detector-prelayout: Laying out IO files (4998 files / total 79968MiB)
<ip-172-31-61-152> 
16m-detector-write-split: (groupid=0, jobs=4): err= 0: pid=2280: Sun Apr 19 22:58:48 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=235, BW=941MiB/s (987MB/s)(199GiB/216306msec)
    slat (nsec): min=151, max=42506, avg=1982.09, stdev=2398.71
    clat (usec): min=554, max=69953, avg=8815.08, stdev=5118.26
     lat (usec): min=556, max=69954, avg=8817.06, stdev=5117.61
    clat percentiles (usec):
     |  1.00th=[ 1188],  5.00th=[ 1303], 10.00th=[ 1450], 20.00th=[ 5211],
     | 30.00th=[ 7046], 40.00th=[ 7767], 50.00th=[ 8455], 60.00th=[ 9241],
     | 70.00th=[10421], 80.00th=[12125], 90.00th=[15008], 95.00th=[17695],
     | 99.00th=[23200], 99.50th=[27657], 99.90th=[42206], 99.95th=[50070],
     | 99.99th=[65799]
   bw (  KiB/s): min=475135, max=1269760, per=100.00%, avg=965119.25, stdev=181143.43, samples=431
   iops        : min=  115, max=  310, avg=235.62, stdev=44.22, samples=431
  write: IOPS=51, BW=206MiB/s (216MB/s)(8736MiB/42485msec); 0 zone resets
    slat (usec): min=98, max=349, avg=222.62, stdev=40.61
    clat (usec): min=1285, max=4669, avg=2319.38, stdev=982.90
     lat (usec): min=1414, max=4925, avg=2542.00, stdev=989.58
    clat percentiles (usec):
     |  1.00th=[ 1319],  5.00th=[ 1336], 10.00th=[ 1352], 20.00th=[ 1401],
     | 30.00th=[ 1450], 40.00th=[ 1516], 50.00th=[ 2376], 60.00th=[ 2540],
     | 70.00th=[ 2737], 80.00th=[ 3621], 90.00th=[ 3785], 95.00th=[ 3949],
     | 99.00th=[ 4228], 99.50th=[ 4293], 99.90th=[ 4555], 99.95th=[ 4555],
     | 99.99th=[ 4686]
   bw (  KiB/s): min=32768, max=327680, per=100.00%, avg=219266.73, stdev=81112.13, samples=81
   iops        : min=    8, max=   80, avg=53.53, stdev=19.80, samples=81
  lat (usec)   : 750=0.12%, 1000=0.11%
  lat (msec)   : 2=14.81%, 4=6.03%, 10=47.67%, 20=28.86%, 50=2.36%
  lat (msec)   : 100=0.05%
  cpu          : usr=0.42%, sys=1.90%, ctx=135041, majf=0, minf=205
  IO depths    : 1=28.6%, 2=41.4%, 4=30.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=50891,2183,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=941MiB/s (987MB/s), 941MiB/s-941MiB/s (987MB/s-987MB/s), io=199GiB (213GB), run=216306-216306msec
  WRITE: bw=206MiB/s (216MB/s), 206MiB/s-206MiB/s (216MB/s-216MB/s), io=8736MiB (9160MB), run=42485-42485msec
### (31) done 172.31.61.152_16m-detector ###### Sun Apr 19 22:58:48 UTC 2020 ###