manual_run_3/manual_32_172.31.63.12_4g-hdf5.log
hostname=ip-172-31-63-12, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-63-12> 4g-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-63-12> 4g-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-63-12> ...
<ip-172-31-63-12> Starting 4 processes
<ip-172-31-63-12> 
4g-detector-write-split: (groupid=0, jobs=4): err= 0: pid=36307: Sun Apr 19 22:58:51 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=75, BW=301MiB/s (316MB/s)(167GiB/568435msec)
    slat (nsec): min=160, max=42022, avg=1641.82, stdev=2405.37
    clat (usec): min=561, max=8256.4k, avg=52866.48, stdev=262392.28
     lat (usec): min=562, max=8256.4k, avg=52868.12, stdev=262392.25
    clat percentiles (usec):
     |  1.00th=[    652],  5.00th=[    709], 10.00th=[    750],
     | 20.00th=[    840], 30.00th=[   3064], 40.00th=[   3720],
     | 50.00th=[   4047], 60.00th=[   8455], 70.00th=[  13829],
     | 80.00th=[  35914], 90.00th=[ 103285], 95.00th=[ 233833],
     | 99.00th=[ 717226], 99.50th=[1002439], 99.90th=[4529849],
     | 99.95th=[6543115], 99.99th=[8220836]
   bw (  KiB/s): min= 8191, max=2293760, per=100.00%, avg=383048.26, stdev=408509.91, samples=915
   iops        : min=    1, max=  560, avg=93.52, stdev=99.73, samples=915
  write: IOPS=100, BW=403MiB/s (423MB/s)(156GiB/396374msec); 0 zone resets
    slat (usec): min=59, max=2008, avg=211.22, stdev=41.08
    clat (usec): min=1301, max=22881, avg=6065.97, stdev=864.70
     lat (usec): min=1448, max=23117, avg=6277.19, stdev=867.78
    clat percentiles (usec):
     |  1.00th=[ 5211],  5.00th=[ 5407], 10.00th=[ 5538], 20.00th=[ 5604],
     | 30.00th=[ 5735], 40.00th=[ 5800], 50.00th=[ 5866], 60.00th=[ 5997],
     | 70.00th=[ 6063], 80.00th=[ 6259], 90.00th=[ 6521], 95.00th=[ 8094],
     | 99.00th=[ 9634], 99.50th=[ 9896], 99.90th=[10945], 99.95th=[12518],
     | 99.99th=[20317]
   bw (  MiB/s): min=   32, max= 2752, per=100.00%, avg=1959.38, stdev=819.07, samples=163
   iops        : min=    8, max=  688, avg=489.84, stdev=204.76, samples=163
  lat (usec)   : 750=5.02%, 1000=9.19%
  lat (msec)   : 2=0.93%, 4=10.46%, 10=55.97%, 20=5.24%, 50=4.59%
  lat (msec)   : 100=3.33%, 250=2.87%, 500=1.39%, 750=0.55%, 1000=0.22%
  lat (msec)   : 2000=0.15%, >=2000=0.11%
  cpu          : usr=0.97%, sys=1.31%, ctx=122493, majf=0, minf=125
  IO depths    : 1=0.1%, 2=0.3%, 4=99.5%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=42788,39935,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=301MiB/s (316MB/s), 301MiB/s-301MiB/s (316MB/s-316MB/s), io=167GiB (179GB), run=568435-568435msec
  WRITE: bw=403MiB/s (423MB/s), 403MiB/s-403MiB/s (423MB/s-423MB/s), io=156GiB (168GB), run=396374-396374msec
### (32) done 172.31.63.12_4g-hdf5 ###### Sun Apr 19 22:58:51 UTC 2020 ###