manual_run_3/manual_33_172.31.61.142_4m-detector.log
hostname=ip-172-31-61-142, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-61-142> 4m-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-61-142> 4m-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-61-142> ...
<ip-172-31-61-142> Starting 4 processes
<ip-172-31-61-142> 
4m-detector-write-split: (groupid=0, jobs=4): err= 0: pid=31996: Sun Apr 19 22:58:49 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=20, BW=83.0MiB/s (87.1MB/s)(36.0GiB/444304msec)
    slat (nsec): min=1219, max=28027, avg=4492.62, stdev=2426.37
    clat (msec): min=3, max=1487, avg=43.53, stdev=102.21
     lat (msec): min=3, max=1487, avg=43.53, stdev=102.21
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    6], 10.00th=[    7], 20.00th=[    8],
     | 30.00th=[   10], 40.00th=[   12], 50.00th=[   14], 60.00th=[   16],
     | 70.00th=[   18], 80.00th=[   34], 90.00th=[   77], 95.00th=[  234],
     | 99.00th=[  542], 99.50th=[  676], 99.90th=[  919], 99.95th=[  986],
     | 99.99th=[ 1485]
   bw (  KiB/s): min= 8191, max=516096, per=100.00%, avg=90469.95, stdev=100430.87, samples=835
   iops        : min=    1, max=  126, avg=22.09, stdev=24.52, samples=835
  write: IOPS=9, BW=38.0MiB/s (39.9MB/s)(10.0GiB/270199msec); 0 zone resets
    slat (usec): min=114, max=375, avg=236.01, stdev=41.63
    clat (usec): min=1328, max=5440, avg=1496.56, stdev=133.79
     lat (usec): min=1500, max=5685, avg=1732.57, stdev=139.01
    clat percentiles (usec):
     |  1.00th=[ 1352],  5.00th=[ 1385], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1450], 40.00th=[ 1467], 50.00th=[ 1483], 60.00th=[ 1500],
     | 70.00th=[ 1516], 80.00th=[ 1549], 90.00th=[ 1598], 95.00th=[ 1647],
     | 99.00th=[ 1844], 99.50th=[ 2212], 99.90th=[ 2474], 99.95th=[ 3523],
     | 99.99th=[ 5473]
   bw (  KiB/s): min= 6770, max=163840, per=100.00%, avg=63888.30, stdev=42775.81, samples=329
   iops        : min=    1, max=   40, avg=15.60, stdev=10.45, samples=329
  lat (msec)   : 2=21.61%, 4=0.22%, 10=24.17%, 20=33.06%, 50=8.80%
  lat (msec)   : 100=5.63%, 250=2.97%, 500=2.49%, 750=0.78%, 1000=0.23%
  lat (msec)   : 2000=0.03%
  cpu          : usr=0.16%, sys=0.33%, ctx=189907, majf=0, minf=206
  IO depths    : 1=99.1%, 2=0.4%, 4=0.5%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9223,2567,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=83.0MiB/s (87.1MB/s), 83.0MiB/s-83.0MiB/s (87.1MB/s-87.1MB/s), io=36.0GiB (38.7GB), run=444304-444304msec
  WRITE: bw=38.0MiB/s (39.9MB/s), 38.0MiB/s-38.0MiB/s (39.9MB/s-39.9MB/s), io=10.0GiB (10.8GB), run=270199-270199msec
### (33) done 172.31.61.142_4m-detector ###### Sun Apr 19 22:58:49 UTC 2020 ###