manual_run_3/manual_34_172.31.60.171_8g-hdf5.log
hostname=ip-172-31-60-171, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-60-171> 8g-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-60-171> 8g-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-60-171> ...
<ip-172-31-60-171> Starting 4 processes
<ip-172-31-60-171> 
8g-detector-write-split: (groupid=0, jobs=4): err= 0: pid=10228: Sun Apr 19 22:58:49 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=59, BW=238MiB/s (250MB/s)(104GiB/448836msec)
    slat (nsec): min=173, max=51859, avg=1372.73, stdev=2151.37
    clat (usec): min=558, max=8269.3k, avg=67168.51, stdev=232063.26
     lat (usec): min=560, max=8269.3k, avg=67169.88, stdev=232063.26
    clat percentiles (usec):
     |  1.00th=[    627],  5.00th=[    717], 10.00th=[    873],
     | 20.00th=[   3621], 30.00th=[   3818], 40.00th=[   7504],
     | 50.00th=[  13829], 60.00th=[  23200], 70.00th=[  36963],
     | 80.00th=[  61080], 90.00th=[ 137364], 95.00th=[ 283116],
     | 99.00th=[ 876610], 99.50th=[1166017], 99.90th=[3137340],
     | 99.95th=[4529849], 99.99th=[7281312]
   bw (  KiB/s): min= 8191, max=1458176, per=100.00%, avg=277894.59, stdev=336659.51, samples=786
   iops        : min=    1, max=  356, avg=67.84, stdev=82.19, samples=786
  write: IOPS=76, BW=306MiB/s (321MB/s)(82.1GiB/274871msec); 0 zone resets
    slat (usec): min=71, max=412, avg=211.85, stdev=42.62
    clat (usec): min=1315, max=2660.1k, avg=37797.94, stdev=146502.11
     lat (usec): min=1524, max=2660.3k, avg=38009.79, stdev=146506.36
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    6], 20.00th=[    6],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    6], 60.00th=[    7],
     | 70.00th=[    9], 80.00th=[   27], 90.00th=[   30], 95.00th=[  165],
     | 99.00th=[  768], 99.50th=[ 1234], 99.90th=[ 1921], 99.95th=[ 2039],
     | 99.99th=[ 2400]
   bw (  KiB/s): min= 8192, max=2867200, per=100.00%, avg=437120.88, stdev=772649.53, samples=389
   iops        : min=    2, max=  700, avg=106.72, stdev=188.63, samples=389
  lat (usec)   : 750=3.64%, 1000=2.82%
  lat (msec)   : 2=0.35%, 4=12.56%, 10=38.37%, 20=5.52%, 50=18.32%
  lat (msec)   : 100=6.59%, 250=8.03%, 500=1.71%, 750=0.90%, 1000=0.51%
  lat (msec)   : 2000=0.53%, >=2000=0.16%
  cpu          : usr=0.63%, sys=0.90%, ctx=48602, majf=0, minf=123
  IO depths    : 1=0.1%, 2=0.1%, 4=99.8%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=26711,21020,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=238MiB/s (250MB/s), 238MiB/s-238MiB/s (250MB/s-250MB/s), io=104GiB (112GB), run=448836-448836msec
  WRITE: bw=306MiB/s (321MB/s), 306MiB/s-306MiB/s (321MB/s-321MB/s), io=82.1GiB (88.2GB), run=274871-274871msec
### (34) done 172.31.60.171_8g-hdf5 ###### Sun Apr 19 22:58:49 UTC 2020 ###